<!DOCTYPE html>
<html>
    <head>
        <meta charset="UTF-8">
</head>
<body>
    <?php
    echo '<h1>Задача 1</h1>';
    echo '<h2>Площадь прямоугольника</h2>';
    $a = 4;
    $b = 7;
    $s = $a * $b;
    echo "Сторона a =$a", '<br>';
    echo "Сторона b =$b", '<br>';
    echo "Формула =a * b", '<br>';
    echo "Площадь =$s"
    ?>
    <?php
    echo '<h2>Периметр прямоугольника</h2>';
    $a = 4;
    $b = 7;
    $s = ($a + $b) * 2;
    echo "Сторона a =$a", '<br>';
    echo "Сторона b =$b", '<br>';
    echo "Формула = (a + b) * 2", '<br>';
    echo "Площадь =$s"
    ?>
<body>
    <?php
    echo '<h1>Задача 2</h1>';
    echo '<h2>Длина окружности</h2>';
    $R = 8;
    $p = 3.14;
    $с = 2 * $p = $R;
    echo "Радиус R = 8", '<br>';
    echo "p = 3.14", '<br>';
    echo "Формула = 2 * p = R", '<br>';
    echo "Длина окружности =$с"
    ?>
    <?php
    echo '<h2>Площадь круга</h2>';
    $R = 8;
    $p = 3.14;
    $s = $p * $R ** 2;
    echo "Радиус R = 8", '<br>';
    echo "p = 3.14", '<br>';
    echo "Формула = p * R **2", '<br>';
    echo "Площадь круга =$s"
    ?>
    <?php
    echo '<h1>Задача 3</h1>';
    echo '<h2>Площадь круга с известной длинной</h2>';
    $p = 3.14;
    $c = 6;
    $s = $с** 2 / (4 * $p);
    echo "Длина = 6", '<br>';
    echo "p = 3.14", '<br>';
    echo "Формула = с** 2 / (4 * p)", '<br>';
    echo "Площадь круга =$s"
    ?>
    <?php
    echo '<h1>Задача 4</h1>';
    echo '<h2>Периметр треугольника</h2>';
    $a = 4;
    $b = 6;
    $c = 8;
    $p = ($a + $b + $c);
    echo "Длина a = 4", '<br>';
    echo "Длина b = 6", '<br>';
    echo "Длина c = 8", '<br>';
    echo "Формула = p = (a + b + c)", '<br>';
    echo "Периметр треугольника =$p"
    ?>
    <?php
    echo '<h1>Задача 5</h1>';
    echo '<h2>Площадь прямоугольного треугольника</h2>';
    $a = 2;
    $s = ($a** sqrt(3)) / 4;
    echo 'Сторона = 6', '<br>';
    echo 'Формула = s = (a** sqrt(3)) / 4', '<br>';
    echo "Площадь прямоугольного треугольника =$s"
    ?> 
    <?php
    echo '<h2>Высота прямоугольного треугольника</h2>';
    $a = 2;
    $h = (sqrt(3) * $a) / 2;
    echo 'Сторона = 6', '<br>';
    echo 'Формула = h = (sqrt(3) * $a) / 2', '<br>';
    echo "Высота прямоугольного треугольника =$h"
    ?>
    <?php
    echo '<h2>Радиус вписанной окружности прямоугольного треугольника</h2>';
    $a = 2;
    $h = (sqrt(3) * $a) / 2;
    echo 'Сторона = 6', '<br>';
    echo 'Формула = h = (sqrt(3) * $a) / 2', '<br>';
    echo "Высота прямоугольного треугольника =$h"
    ?>
    <?php
    echo '<h2>Радиус описанной окружности прямоугольного треугольника</h2>';
    $a = 2;
    $h = (sqrt(3) * $a) / 2;
    echo 'Сторона = 6', '<br>';
    echo 'Формула = h = (sqrt(3) * $a) / 2', '<br>';
    echo "Высота прямоугольного треугольника =$h"
    ?>
</body>
<html>